CreLab/stm32-gba-nds-cart-reader/src/nds_cart.c
#include <assert.h>
#include <stdbool.h>
#include <stm32f1xx_hal.h>
#include <string.h>

#include "nds_cart.h"
#include "util.h"
#include "gpios.h"
#include "print.h"

#define NDS_PAGE_SIZE 0x1000
#define NDS_CHUNK_SIZE 0x200
#define NDS_SMALL_HEADER_SIZE 0x200
#define NDS_EXT_HEADER_SIZE 0x1000

__attribute__((always_inline)) static inline void wait_cycles(size_t cycles)
{
#pragma GCC unroll 64
    for (size_t i = 0; i < cycles; i++)
    {
        __asm__ volatile("nop");
    }
}

__attribute__((always_inline)) static inline uint8_t data_in_cycle(size_t cycles)
{
    clk_low();
    wait_cycles(cycles);
    uint8_t ret = data_input();
    clk_high();
    wait_cycles(cycles);
    return ret;
}

__attribute__((always_inline)) static inline void data_out_cycle(uint8_t d, size_t cycles)
{
    clk_low();
    data_output(d);
    wait_cycles(cycles);
    clk_high();
    wait_cycles(cycles);
}

__attribute__((always_inline)) static inline uint8_t data_in_cycle_42(void)
{
    return data_in_cycle(8);
}

__attribute__((always_inline)) static inline uint8_t data_in_cycle_67(void)
{
    return data_in_cycle(5);
}

__attribute__((always_inline)) static inline void data_out_cycle_42(uint8_t d)
{
    data_out_cycle(d, 8);
}

__attribute__((always_inline)) static inline void data_out_cycle_67(uint8_t d)
{
    data_out_cycle(d, 5);
}

enum nds_proto_rev
{
    NDS_PROTO_REV_MROM,
    NDS_PROTO_REV_1TROM_NAND,
};

static s_blowfish_t blowfish_buf = {0};

static void nds_cart_cmd_dummy(s_nds_cart_config *ctrl);
static void nds_cart_cmd_main_data_read(s_nds_cart_config *ctrl, uint8_t *data, uint32_t addr);
static void nds_cart_cmd_enable_key1_nds(s_nds_cart_config *ctrl);
static void nds_cart_cmd_enable_key2(s_nds_cart_config *ctrl);
static void nds_cart_cmd_chip_id_key1(s_nds_cart_config *ctrl, s_nds_chip_id *chip_id);
static void nds_cart_cmd_get_secure_area(s_nds_cart_config *ctrl, uint8_t *data, size_t page);
static void nds_cart_cmd_chip_id_key2(s_nds_cart_config *ctrl, s_nds_chip_id *chip_id);
static void nds_cart_cmd_enable_data_mode(s_nds_cart_config *ctrl);

static void nds_cart_read_header(s_nds_cart_config *ctrl, uint8_t *data, bool extended);
static void nds_cart_read_main_data_page(s_nds_cart_config *ctrl, uint8_t *data, size_t page);
static void nds_cart_read_secure_area_page(s_nds_cart_config *ctrl, uint8_t *data, size_t page);

static void nds_cart_reset(s_nds_cart_config *ctrl);

static void key1_init_keycode(uint32_t idcode, uint32_t level, uint32_t modulo, bool dsi);
static void key1_encrypt_64bit(const s_blowfish_t *pBuf, uint32_t *data);
static void key1_decrypt_64bit(const s_blowfish_t *pBuf, uint32_t *data);

static void nds_cart_begin_key1(s_nds_cart_config *ctrl)
{
    myassert(ctrl->state == NDS_CART_RAW,
             "cart must be in raw mode before beginning key1\r\n", NULL);

    uint32_t secure_area_disable[2] = {ctrl->secure_area_disable[0],
                                       ctrl->secure_area_disable[1]};

    key1_init_keycode(ctrl->game_code, 1, 8, false);
    key1_decrypt_64bit(&blowfish_buf, secure_area_disable);
    key1_init_keycode(ctrl->game_code, 2, 8, false);

    nds_cart_cmd_enable_key1_nds(ctrl);

    ctrl->state = NDS_CART_KEY1;

    nds_cart_cmd_enable_key2(ctrl);

    s_nds_chip_id chip_id;
    nds_cart_cmd_chip_id_key1(ctrl, &chip_id);

    if (memcmp(&chip_id, &ctrl->chip_id, sizeof(chip_id)))
    {
        DEBUG_PRINT("chip_id with key1 cmd doesn't match initial chip_id:\r\n");
        print_chip_id(&chip_id);
    }
}

static void nds_cart_begin_key2(s_nds_cart_config *ctrl)
{
    myassert(ctrl->state == NDS_CART_KEY1,
             "cart must be in key1 mode before beginning key2\r\n", NULL);

    nds_cart_cmd_enable_data_mode(ctrl);

    ctrl->state = NDS_CART_KEY2;

    s_nds_chip_id chip_id;
    nds_cart_cmd_chip_id_key2(ctrl, &chip_id);

    if (memcmp(&chip_id, &ctrl->chip_id, sizeof(chip_id)))
    {
        DEBUG_PRINT("chip_id with key2 cmd doesn't match initial chip_id:\r\n");
        print_chip_id(&chip_id);
    }
}

void nds_cart_init(void)
{
    static s_nds_cart_config ctrl = {0};

    data_dir_input();
    clk_high();
    romcs_high();
    reset_high();
    eepromcs_high();
    MODIFY_REG(GPIOC->CRH, 0xFFFFu, 0x1111u);

    nds_cart_reset(&ctrl);
}

static void nds_cart_change_state(s_nds_cart_config *ctrl, uint8_t state)
{
    if (state == NDS_CART_UNINITIALIZED)
    {
        nds_cart_reset(ctrl);
    }
    else if (state == NDS_CART_RAW && ctrl->state != NDS_CART_RAW)
    {
        nds_cart_rom_init(ctrl);
        assert(ctrl->state == NDS_CART_RAW);
    }
    else if (state == NDS_CART_KEY1 && ctrl->state != NDS_CART_KEY1)
    {
        nds_cart_rom_init(ctrl);
        nds_cart_begin_key1(ctrl);
        assert(ctrl->state == NDS_CART_KEY1);
    }
    else if (state == NDS_CART_KEY2 && ctrl->state != NDS_CART_KEY2)
    {
        nds_cart_rom_init(ctrl);
        nds_cart_begin_key1(ctrl);
        nds_cart_begin_key2(ctrl);
        assert(ctrl->state == NDS_CART_KEY2);
    }
    else if (state == ctrl->state)
    {
        return;
    }
    else
    {
        myassert(false, "switching to invalid state: 0x%x\r\n", (uint32_t) state);
    }
}

void nds_cart_exec_command(s_nds_cart_config* ctrl, uint64_t org_cmd, uint8_t *data, size_t len)
{
    romcs_low();
    data_dir_output();

    e_nds_cart_clk_rate clk_rate;
    bool gap_clk;
    bool key2_result;
    size_t gap1;
    size_t gap2;
    uint64_t cmd;

    if (ctrl->state == NDS_CART_KEY1)
    {
        clk_rate = ctrl->key1_clk_rate;
        gap_clk = ctrl->key1_gap_clk;
        gap1 = ctrl->key1_gap1 + ctrl->key1_gap2;
        gap2 = ctrl->key1_gap2;

        cmd = key1_encrypt_cmd(org_cmd);
        key2_result = true;
    }
    else
    {
        clk_rate = ctrl->normal_clk_rate;
        gap_clk = ctrl->normal_gap_clk;
        gap1 = ctrl->normal_gap1 + ctrl->normal_gap2;
        gap2 = ctrl->normal_gap2;

        if (ctrl->state == NDS_CART_KEY2)
        {
            cmd = key2_encrypt_cmd(ctrl, org_cmd);
            key2_result = true;
        }
        else
        {
            cmd = org_cmd;
            key2_result = false;
        }
    }

    uint8_t *cmd_data = (uint8_t *) &cmd;

