CreLab/stm32-gba-nds-cart-reader/src/nds_cart.c
    if (clk_rate == NDS_CART_CLK_6P7_MHZ)
    {
        for (size_t i = 0; i < 8; i++)
        {
            data_out_cycle_67(cmd_data[i]);
        }
    }
    else
    {
        for (size_t i = 0; i < 8; i++)
        {
            data_out_cycle_42(cmd_data[i]);
        }
    }

    data_dir_input();

    if (gap_clk)
    {
        if (clk_rate == NDS_CART_CLK_6P7_MHZ)
        {
            for (size_t i = 0; i < gap1; i++)
            {
                data_in_cycle_67();
            }
        }
        else
        {
            for (size_t i = 0; i < gap1; i++)
            {
                data_in_cycle_42();
            }
        }

        if (key2_result)
        {
            ctrl->key2 = key2_xcrypt(ctrl->key2, NULL, gap1);
        }
    }
    else
    {
        WAIT(gap1 * 12);
    }

    if (len != 0)
    {
        while (true)
        {
            size_t block_size = len;
            if (block_size > NDS_CHUNK_SIZE)
            {
                block_size = NDS_CHUNK_SIZE;
            }

            if (clk_rate == NDS_CART_CLK_6P7_MHZ)
            {
                for (size_t i = 0; i < block_size; i++)
                {
                    data[i] = data_in_cycle_67();
                }
            }
            else
            {
                for (size_t i = 0; i < block_size; i++)
                {
                    data[i] = data_in_cycle_42();
                }
            }

            if (key2_result)
            {
                ctrl->key2 = key2_xcrypt(ctrl->key2, data, block_size);
            }

            data += block_size;
            len -= block_size;

            if (len == 0)
            {
                break;
            }

            if (gap_clk)
            {
                if (clk_rate == NDS_CART_CLK_6P7_MHZ)
                {
                    for (size_t i = 0; i < gap2; i++)
                    {
                        data_in_cycle_67();
                    }
                }
                else
                {
                    for (size_t i = 0; i < gap2; i++)
                    {
                        data_in_cycle_42();
                    }
                }

                if (key2_result)
                {
                    ctrl->key2 = key2_xcrypt(ctrl->key2, NULL, gap2);
                }
            }
            else
            {
                WAIT(gap2 * 12);
            }
        }
    }

    data_dir_input();
    romcs_high();
    WAIT(10);
}

static void nds_cart_cmd_dummy(s_nds_cart_config *ctrl)
{
    const uint64_t cmd = 0x9F00000000000000;
    uint8_t dummy_data[0x2000];

    nds_cart_exec_command(ctrl, cmd, dummy_data, sizeof(dummy_data));
}

static void nds_cart_rom_read_page(s_nds_cart_config *ctrl, uint8_t *read_buffer, size_t page_addr)
{
    page_addr &= ~0xFFFu;

    if (page_addr == 0)
    {
        nds_cart_change_state(ctrl, NDS_CART_RAW);
        if (ctrl->dsi)
        {
            nds_cart_read_header(ctrl, read_buffer, true);
            memset(&read_buffer[NDS_SMALL_HEADER_SIZE], 0, NDS_PAGE_SIZE - NDS_EXT_HEADER_SIZE);
        }
        else
        {
            nds_cart_read_header(ctrl, read_buffer, false);
            memset(&read_buffer[NDS_SMALL_HEADER_SIZE], 0, NDS_PAGE_SIZE - NDS_SMALL_HEADER_SIZE);
        }
    }
    else if (page_addr < 0x4000)
    {
        memset(read_buffer, 0, NDS_PAGE_SIZE);
    }
    else if (page_addr < 0x8000)
    {
        if (ctrl->has_secure_area)
        {
            nds_cart_change_state(ctrl, NDS_CART_KEY1);
            nds_cart_read_secure_area_page(ctrl, read_buffer, page_addr >> 12);
        }
        else
        {
            memset(read_buffer, 0, NDS_PAGE_SIZE);
        }
    }
    else
    {
        nds_cart_change_state(ctrl, NDS_CART_KEY2);
        nds_cart_read_main_data_page(ctrl, read_buffer, page_addr >> 12);
    }
}

void nds_cart_rom_read(s_nds_cart_config *ctrl, size_t byte_addr, uint8_t *data, size_t len)
{
    uint8_t read_buffer[NDS_PAGE_SIZE];

    while (len > 0)
    {
        size_t page_addr = byte_addr & ~0xFFFu;
        size_t page_index = byte_addr & 0xFFFu;

        size_t read_len = NDS_PAGE_SIZE - page_index;
        if (read_len > len)
        {
            read_len = len;
        }

        nds_cart_rom_read_page(ctrl, read_buffer, page_addr);
        memcpy(data, &read_buffer[page_index], read_len);
        byte_addr += read_len;
        len -= read_len;
        data += read_len;
    }
}

bool nds_cart_rom_init(s_nds_cart_config *ctrl)
{
    nds_cart_reset(ctrl);

    HAL_Delay(10);

    s_nds_chip_id chip_id;
    s_nds_header header;

    ctrl->state = NDS_CART_RAW;

    nds_cart_cmd_dummy(ctrl);
    nds_cart_read_header(ctrl, (uint8_t *) &header, false);
    nds_cart_cmd_chip_id(ctrl, (uint8_t *) &chip_id);

    ctrl->chip_id = chip_id;
    ctrl->protocol_rev = chip_id.cart_protocol;
    ctrl->normal_gap_clk = header.gamecart_bus_timing_normal.clk_gap;
    ctrl->normal_clk_rate = header.gamecart_bus_timing_normal.clk_rate;
    ctrl->normal_gap1 = header.gamecart_bus_timing_normal.gap1_len;
    ctrl->normal_gap2 = header.gamecart_bus_timing_normal.gap2_len;
    ctrl->key1_gap_clk = chip_id.cart_protocol == 0 ? true : false;
    ctrl->key1_clk_rate = header.gamecart_bus_timing_key1.clk_rate;
    ctrl->key1_gap1 = header.gamecart_bus_timing_key1.gap1_len;
    ctrl->key1_gap2 = header.gamecart_bus_timing_key1.gap2_len;
    ctrl->key1_delay_ms = (uint16_t) ceil_div(header.secure_area_delay * 1000, 131072);

    if (header.unit_code == 0x0)
    {
        ctrl->nds = true;
        ctrl->dsi = false;
    }
    else if (header.unit_code == 0x2)
    {
        ctrl->nds = true;
        ctrl->dsi = true;
    }
    else if (header.unit_code == 0x3)
    {
        ctrl->nds = false;
        ctrl->dsi = true;
    }
    else
    {
        DEBUG_PRINTF("NDS cart: illegal unit code: %02x", header.unit_code);
        return false;
    }

    if (header.arm9_rom_offset >= 0x8000)
    {
        ctrl->has_secure_area = false;
    }
    else
    {
        ctrl->has_secure_area = true;
    }

    ctrl->game_code = header.game_code_uint;
    ctrl->secure_area_disable[0] = header.secure_area_disable_uint[0];
    ctrl->secure_area_disable[1] = header.secure_area_disable_uint[1];
    ctrl->seed_byte = header.encryption_seed_select;

    ctrl->kkkkk = 0x98bc7;
    ctrl->iii = 0x20C;
    ctrl->jjj = 0xB5B;
    ctrl->llll = 0xd44e;
    ctrl->mmm = 0x733;
    ctrl->nnn = 0xc55;
    ctrl->key2 = key2_init(ctrl, true);

