CreLab/stm32-gba-nds-cart-reader/src/nds_cart.c
    return true;
}

static void nds_cart_read_header(s_nds_cart_config *ctrl, uint8_t *data, bool extended)
{
    assert(ctrl->state == NDS_CART_RAW);

    uint64_t cmd = 0x0000000000000000;

    if (extended)
    {
        if (ctrl->protocol_rev == NDS_PROTO_REV_1TROM_NAND)
        {
            for (size_t chunk = 0; chunk < NDS_EXT_HEADER_SIZE / NDS_CHUNK_SIZE; chunk++)
            {
                size_t chunk_addr = chunk * NDS_CHUNK_SIZE;
                cmd |= (uint64_t) chunk_addr << 24;
                nds_cart_exec_command(ctrl, cmd, &data[chunk_addr], NDS_CHUNK_SIZE);
            }
        }
        else
        {
            nds_cart_exec_command(ctrl,cmd, data, NDS_EXT_HEADER_SIZE);
        }
    }
    else
    {
        nds_cart_exec_command(ctrl,cmd, data, NDS_SMALL_HEADER_SIZE);
        for (size_t i = NDS_SMALL_HEADER_SIZE; i < NDS_EXT_HEADER_SIZE; i++)
        {
            data[i] = 0;
        }            
    }
}

void nds_cart_cmd_chip_id(s_nds_cart_config *ctrl, uint8_t data[4])
{
    assert(ctrl->state == NDS_CART_RAW);

    const uint64_t cmd = 0x9000000000000000;

    nds_cart_exec_command(ctrl, cmd, data, 4);
}

static void nds_cart_cmd_main_data_read(s_nds_cart_config *ctrl, uint8_t *data, uint32_t addr)
{
    uint64_t cmd = 0xB700000000000000;
    cmd |= ((uint64_t) addr & 0xFFFFFFFF) << 24;

    nds_cart_exec_command(ctrl, cmd, data, NDS_CHUNK_SIZE);
}

static void nds_cart_cmd_enable_key1_nds(s_nds_cart_config *ctrl)
{
    uint8_t reply[1];
    uint64_t cmd = 0x3C00000000000000;
    cmd |= (uint64_t) (ctrl->iii & 0xFFF) << 44;
    cmd |= (uint64_t) (ctrl->jjj & 0xFFF) << 32;
    cmd |= (uint64_t) (ctrl->kkkkk & 0xFFFFF) << 8;
    nds_cart_exec_command(ctrl, cmd, reply, 0);
}

static void nds_cart_cmd_enable_key2(s_nds_cart_config *ctrl)
{
    assert(ctrl->state == NDS_CART_KEY1);

    uint8_t reply[1];
    uint64_t cmd = 0x4000000000000000;
    cmd |= (uint64_t) (ctrl->llll & 0xFFFF) << 44;
    cmd |= (uint64_t) (ctrl->mmm & 0xFFF) << 32;
    cmd |= (uint64_t) (ctrl->nnn & 0xFFF) << 20;
    cmd |= (uint64_t) (ctrl->kkkkk & 0xFFFFF) << 0;

    assert(cmd == key1_decrypt_cmd(key1_encrypt_cmd(cmd)));

    if (ctrl->protocol_rev == NDS_PROTO_REV_MROM)
    {
        HAL_Delay(ctrl->key1_delay_ms);
        nds_cart_exec_command(ctrl, cmd, reply, 0);
        ctrl->key2 = key2_init(ctrl, false);
    }
    else
    {
        nds_cart_exec_command(ctrl, cmd, reply, 0);
        HAL_Delay(ctrl->key1_delay_ms);
        ctrl->key2 = key2_init(ctrl, false);
        nds_cart_exec_command(ctrl, cmd, reply, 0);
    }

    ctrl->kkkkk += 1;
}

static void nds_cart_cmd_chip_id_key1(s_nds_cart_config *ctrl, s_nds_chip_id *chip_id)
{
    assert(ctrl->state == NDS_CART_KEY1);

    uint64_t cmd = 0x1000000000000000;
    cmd |= (uint64_t) (ctrl->llll & 0xFFFF) << 44;
    cmd |= (uint64_t) (ctrl->iii & 0xFFF) << 32;
    cmd |= (uint64_t) (ctrl->jjj & 0xFFF) << 20;
    cmd |= (uint64_t) (ctrl->kkkkk & 0xFFFFF) << 0;

    if (ctrl->protocol_rev == NDS_PROTO_REV_MROM)
    {
        HAL_Delay(ctrl->key1_delay_ms);
        nds_cart_exec_command(ctrl, cmd, (uint8_t *) chip_id, sizeof(*chip_id));
    }
    else
    {
        nds_cart_exec_command(ctrl, cmd, (uint8_t *) chip_id, 0);
        HAL_Delay(ctrl->key1_delay_ms);
        nds_cart_exec_command(ctrl, cmd, (uint8_t *) chip_id, sizeof(*chip_id));
    }

    ctrl->kkkkk += 1;
}

static void nds_cart_cmd_get_secure_area(s_nds_cart_config *ctrl, uint8_t *data, size_t page)
{
    assert(ctrl->state == NDS_CART_KEY1);

    uint64_t cmd = 0x2000000000000000;
    cmd |= (uint64_t) (page & 0xFFFF) << 44;
    cmd |= (uint64_t) (ctrl->iii & 0xFFF) << 32;
    cmd |= (uint64_t) (ctrl->jjj & 0xFFF) << 20;
    cmd |= (uint64_t) (ctrl->kkkkk & 0xFFFFF) << 0;

    if (ctrl->protocol_rev == NDS_PROTO_REV_MROM)
    {
        HAL_Delay(ctrl->key1_delay_ms);
        nds_cart_exec_command(ctrl, cmd, data, NDS_PAGE_SIZE);
    }
    else
    {
        nds_cart_exec_command(ctrl, cmd, data, 0);
        HAL_Delay(ctrl->key1_delay_ms);
        for (size_t i = 0; i < NDS_PAGE_SIZE / NDS_CHUNK_SIZE; i++)
        {
            nds_cart_exec_command(ctrl, cmd, data, NDS_CHUNK_SIZE);
            data += NDS_CHUNK_SIZE;
        }
    }

    ctrl->kkkkk += 1;
}

static void nds_cart_cmd_enable_data_mode(s_nds_cart_config *ctrl)
{
    assert(ctrl->state == NDS_CART_KEY1);

    uint8_t reply[1];
    uint64_t cmd = 0xA000000000000000;
    cmd |= (uint64_t) (ctrl->llll & 0xFFFF) << 44;
    cmd |= (uint64_t) (ctrl->iii & 0xFFF) << 32;
    cmd |= (uint64_t) (ctrl->jjj & 0xFFF) << 20;
    cmd |= (uint64_t) (ctrl->kkkkk & 0xFFFFF) << 0;

    if (ctrl->protocol_rev == NDS_PROTO_REV_MROM)
    {
        HAL_Delay(ctrl->key1_delay_ms);
        nds_cart_exec_command(ctrl, cmd, reply, 0);
    }
    else
    {
        nds_cart_exec_command(ctrl, cmd, reply, 0);
        HAL_Delay(ctrl->key1_delay_ms);
        nds_cart_exec_command(ctrl, cmd, reply, 0);
    }

    ctrl->kkkkk += 1;
}

static void nds_cart_cmd_chip_id_key2(s_nds_cart_config *ctrl, s_nds_chip_id *chip_id)
{
    assert(ctrl->state == NDS_CART_KEY2);

    const uint64_t cmd = 0xB800000000000000;
    nds_cart_exec_command(ctrl, cmd, (uint8_t *) chip_id, sizeof(*chip_id));
}

static void nds_cart_read_main_data_page(s_nds_cart_config *ctrl, uint8_t *data, size_t page)
{
    assert(ctrl->state == NDS_CART_KEY2);

    for (size_t chunk = 0; chunk < NDS_PAGE_SIZE / NDS_CHUNK_SIZE; chunk++)
    {
        uint32_t addr = (page << 12) + chunk * NDS_CHUNK_SIZE;
        nds_cart_cmd_main_data_read(ctrl, data, addr);
        data += NDS_CHUNK_SIZE;
    }
}

static void nds_cart_read_secure_area_page(s_nds_cart_config *ctrl, uint8_t *data, size_t page)
{
    // TODO secure are delay
    assert(ctrl->state == NDS_CART_KEY1);
    assert(page >= 4 && page <= 7);

    union
    {
        uint8_t _u8[NDS_PAGE_SIZE];
        uint32_t _u32[NDS_PAGE_SIZE / 4];
    } secure_area_page;

    nds_cart_cmd_get_secure_area(ctrl, secure_area_page._u8, page);

    if (page == 4)
    {
        key1_decrypt_64bit(&blowfish_buf, &secure_area_page._u32[0]);
        key1_init_keycode(ctrl->game_code, 3, 8, false);
        const size_t SEC_AREA_KEY1_CRYPT_LEN = 0x800;
        for (size_t i = 0; i < SEC_AREA_KEY1_CRYPT_LEN / sizeof(uint32_t); i += 2)
            key1_decrypt_64bit(&blowfish_buf, &secure_area_page._u32[i]);

