CreLab/stm32-gba-nds-cart-reader/src/nds_cart.c
        if (memcmp(secure_area_page._u8, "encryObj", 8))
        {
            DEBUG_PRINT("ERROR: secure area not correctly decrypted:");
            for (size_t i = 0; i < 8; i++)
                DEBUG_PRINTF(" %02x", secure_area_page._u8[i]);
            DEBUG_PRINT("\r\n");
        }
        else
        {
            secure_area_page._u32[0] = 0xE7FFDEFF;
            secure_area_page._u32[1] = 0xE7FFDEFF;
        }

        key1_init_keycode(ctrl->game_code, 2, 8, false);
    }

    memcpy(data, secure_area_page._u8, sizeof(secure_area_page._u8));
}

static void nds_cart_reset(s_nds_cart_config *ctrl)
{
    reset_low();
    HAL_Delay(10);
    reset_high();

    ctrl->state = NDS_CART_UNINITIALIZED;
    ctrl->normal_gap_clk = false;
    ctrl->key1_gap_clk = false;
    ctrl->normal_clk_rate = false;
    ctrl->key1_clk_rate = false;
    ctrl->nds = true;
    ctrl->dsi = false;
    ctrl->has_secure_area = true;
    ctrl->normal_gap1 = 0x8F8;
    ctrl->key1_gap1 = 0x8F8;
    ctrl->normal_gap2 = 0x18;
    ctrl->key1_gap2 = 0x18;
}

static void key1_encrypt_64bit(const s_blowfish_t *pBuf, uint32_t *data)
{
    uint32_t y = data[0];
    uint32_t x = data[1];

    for (int i = 0; i <= 15; i++)
    {
        uint32_t z = pBuf->P[i] ^ x;
        x = pBuf->S[0][(z >> 24) & 0xFF];
        x = pBuf->S[1][(z >> 16) & 0xFF] + x;
        x = pBuf->S[2][(z >> 8) & 0xFF] ^ x;
        x = pBuf->S[3][(z >> 0) & 0xFF] + x;
        x = y ^ x;
        y = z;
    }

    data[0] = x ^ pBuf->P[16];
    data[1] = y ^ pBuf->P[17];
}

static void key1_decrypt_64bit(const s_blowfish_t *pBuf, uint32_t *data)
{
    uint32_t y = data[0];
    uint32_t x = data[1];

    for (int i = 17; i >= 2; i--)
    {
        uint32_t z = pBuf->P[i] ^ x;
        x = pBuf->S[0][(z >> 24) & 0xFF];
        x = pBuf->S[1][(z >> 16) & 0xFF] + x;
        x = pBuf->S[2][(z >> 8) & 0xFF] ^ x;
        x = pBuf->S[3][(z >> 0) & 0xFF] + x;
        x = y ^ x;
        y = z;
    }

    data[0] = x ^ pBuf->P[1];
    data[1] = y ^ pBuf->P[0];
}

uint64_t key1_encrypt_cmd(uint64_t cmd)
{
    union
    {
        uint32_t _u32[2];
        uint64_t _u64;
    } u;

    u._u64 = cmd;
    key1_encrypt_64bit(&blowfish_buf, u._u32);
    return u._u64;
}

uint64_t key1_decrypt_cmd(uint64_t cmd)
{
    union
    {
        uint32_t _u32[2];
        uint64_t _u64;
    } u;

    u._u64 = cmd;
    key1_decrypt_64bit(&blowfish_buf, u._u32);
    return u._u64;
}

static void key1_apply_keycode(uint32_t *keycode, uint32_t modulo)
{
    uint32_t scratch[2];
    scratch[0] = scratch[1] = 0;

    key1_encrypt_64bit(&blowfish_buf, &keycode[1]);
    key1_encrypt_64bit(&blowfish_buf, &keycode[0]);

    for (uint32_t i = 0; i < 18; i++)
    {
        blowfish_buf.P[i] ^= __builtin_bswap32(keycode[i % (modulo / 4u)]);
    }

    for (uint32_t i = 0; i < 18; i += 2)
    {
        key1_encrypt_64bit(&blowfish_buf, scratch);
        blowfish_buf.P[i + 0] = scratch[1];
        blowfish_buf.P[i + 1] = scratch[0];
    }

    for (uint32_t i = 0; i < 4; i++)
    {
        for (uint32_t j = 0; j < 256; j += 2)
        {
            key1_encrypt_64bit(&blowfish_buf, scratch);
            blowfish_buf.S[i][j + 0] = scratch[1];
            blowfish_buf.S[i][j + 1] = scratch[0];
        }
    }
}

static void key1_init_keycode(uint32_t idcode, uint32_t level, uint32_t modulo, bool dsi)
{
    uint32_t keycode[3];

    if (dsi)
    {
        memcpy(&blowfish_buf, dsi_cart_key, sizeof(blowfish_buf));
    }
    else
    {
        memcpy(&blowfish_buf, nds_cart_key, sizeof(blowfish_buf));
    }

    keycode[0] = idcode;
    keycode[1] = idcode / 2;
    keycode[2] = idcode * 2;

    if (level >= 1)
    {
        key1_apply_keycode(keycode, modulo);
    }

    if (level >= 2)
    {
        key1_apply_keycode(keycode, modulo);
    }

    keycode[1] *= 2;
    keycode[2] /= 2;

    if (level >= 3)
    {
        key1_apply_keycode(keycode, modulo);
    }
}

s_key2 key2_init(s_nds_cart_config *ctrl, bool hw_reset)
{
    s_key2 key = {0};

    uint64_t seed0 = 0x58C56DE0E8;
    uint64_t seed1 = 0x5C879B9B05;

    if (!hw_reset)
    {
        const uint64_t mmm = (uint64_t) (ctrl->mmm & 0xFFF) << 27;
        const uint64_t nnn = (uint64_t) (ctrl->nnn & 0xFFF) << 15;
        static const uint8_t seedbytes[8] = {0xE8, 0x4D, 0x5A, 0xB1, 0x17, 0x8F, 0x99, 0xD5};

        seed0 = (mmm | nnn) + 0x6000 + seedbytes[ctrl->seed_byte % 8];
    }

    key.x = bitrev_64(seed0) >> (64 - 39);
    key.y = bitrev_64(seed1) >> (64 - 39);

    return key;
}

s_key2 key2_xcrypt(s_key2 key2, uint8_t *data, size_t len)
{
    s_key2 key = {0};
            
    uint64_t x = key2.x;
    uint64_t y = key2.y;

    if (data)
    {
        for (size_t i = 0; i < len; i++)
        {
            x = (((x >> 5) ^ (x >> 17) ^ (x >> 18) ^ (x >> 31)) & 0xFF) + (x << 8);
            x &= 0x7FFFFFFFFF;
            y = (((y >> 5) ^ (y >> 23) ^ (y >> 18) ^ (y >> 31)) & 0xFF) + (y << 8);
            y &= 0x7FFFFFFFFF;
            data[i] = (uint8_t) (data[i] ^ x ^ y);
        }
    }
    else
    {
        for (size_t i = 0; i < len; i++)
        {
            x = (((x >> 5) ^ (x >> 17) ^ (x >> 18) ^ (x >> 31)) & 0xFF) + (x << 8);
            x &= 0x7FFFFFFFFF;
            y = (((y >> 5) ^ (y >> 23) ^ (y >> 18) ^ (y >> 31)) & 0xFF) + (y << 8);
            y &= 0x7FFFFFFFFF;
        }
    }

    key.x = x;
    key.y = y;
    
    return key;
}

uint64_t key2_encrypt_cmd(s_nds_cart_config * ctrl, uint64_t cmd)
{
    uint8_t cmd_data[8];

#pragma GCC unroll 8
    for (size_t i = 0; i < 8; i++)
    {
        cmd_data[i] = (uint8_t) (cmd >> 56);
        cmd <<= 8;
    }

    ctrl->key2 = key2_xcrypt(ctrl->key2, cmd_data, sizeof(cmd_data));

    cmd = 0;
#pragma GCC unroll 8
    for (size_t i = 0; i < 8; i++)
    {
        cmd <<= 8;
        cmd |= cmd_data[i];
    }

    return cmd;
}
